tests/performance/jmeter/results/escala-load-25u-fixed.log
2026-06-26 15:34:51,575 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-06-26 15:34:51,663 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.5/bin/user.properties
2026-06-26 15:34:51,665 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.5/bin/system.properties
2026-06-26 15:34:51,666 INFO o.a.j.JMeter: Setting System property: log4j2.formatMsgNoLookups=true
2026-06-26 15:34:51,666 INFO o.a.j.JMeter: Setting JMeter property: threads=25
2026-06-26 15:34:51,667 INFO o.a.j.JMeter: Setting JMeter property: ramp=10
2026-06-26 15:34:51,667 INFO o.a.j.JMeter: Setting JMeter property: duration=60
2026-06-26 15:34:51,667 INFO o.a.j.JMeter: Setting JMeter property: thinkTimeMs=300
2026-06-26 15:34:51,667 INFO o.a.j.JMeter: Setting JMeter property: resultsFile=tests/performance/jmeter/results/escala-load-25u-fixed-listener.jtl
2026-06-26 15:34:51,714 INFO o.a.j.JMeter: Copyright (c) 1998-2022 The Apache Software Foundation
2026-06-26 15:34:51,715 INFO o.a.j.JMeter: Version 5.5
2026-06-26 15:34:51,716 INFO o.a.j.JMeter: java.version=1.8.0_275
2026-06-26 15:34:51,716 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-06-26 15:34:51,716 INFO o.a.j.JMeter: os.name=Linux
2026-06-26 15:34:51,717 INFO o.a.j.JMeter: os.arch=amd64
2026-06-26 15:34:51,717 INFO o.a.j.JMeter: os.version=6.6.114.1-microsoft-standard-WSL2
2026-06-26 15:34:51,717 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-06-26 15:34:51,717 INFO o.a.j.JMeter: java.awt.headless=true
2026-06-26 15:34:51,718 INFO o.a.j.JMeter: Max memory     =7147094016
2026-06-26 15:34:51,718 INFO o.a.j.JMeter: Available Processors =6
2026-06-26 15:34:51,738 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-06-26 15:34:51,739 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-06-26 15:34:51,739 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.5
2026-06-26 15:34:51,740 INFO o.a.j.JMeter: user.dir  =/work
2026-06-26 15:34:51,740 INFO o.a.j.JMeter: PWD       =/work
2026-06-26 15:34:51,741 INFO o.a.j.JMeter: IP: 172.17.0.2 Name: b2b4de08ad07 FullName: b2b4de08ad07
2026-06-26 15:34:51,819 INFO o.a.j.s.FileServer: Default base='/work'
2026-06-26 15:34:51,823 INFO o.a.j.s.FileServer: Set new base='/work/tests/performance/jmeter'
2026-06-26 15:34:52,398 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-06-26 15:34:52,479 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-06-26 15:34:52,501 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-06-26 15:34:52,549 INFO o.a.j.s.SaveService: Loading file: tests/performance/jmeter/escala-load-test.jmx
2026-06-26 15:34:52,791 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-06-26 15:34:52,792 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-06-26 15:34:52,792 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-06-26 15:34:52,793 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-06-26 15:34:52,793 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-06-26 15:34:52,793 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-06-26 15:34:54,217 INFO o.a.j.JMeter: Creating summariser <summary>
2026-06-26 15:34:54,248 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-06-26 15:34:54,252 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-06-26 15:34:54,253 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-06-26 15:34:54,283 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-06-26 15:34:54,283 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-06-26 15:34:55,469 INFO o.a.j.JMeter: Running test (1782480895469)
2026-06-26 15:34:55,699 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Usuarios simultaneos autenticados
2026-06-26 15:34:55,700 INFO o.a.j.e.StandardJMeterEngine: Starting 25 threads for group Usuarios simultaneos autenticados.
2026-06-26 15:34:55,700 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-06-26 15:34:55,701 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=25 ramp-up=10 delayedStart=false
2026-06-26 15:34:55,737 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-1
2026-06-26 15:34:55,800 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-06-26 15:34:55,800 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-06-26 15:34:56,121 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-2
2026-06-26 15:34:56,124 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = b2b4de08ad07
2026-06-26 15:34:56,146 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-06-26 15:34:56,153 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-06-26 15:34:56,153 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2026-06-26 15:34:56,153 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-06-26 15:34:56,154 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-06-26 15:34:56,519 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-3
2026-06-26 15:34:56,916 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-4
2026-06-26 15:34:57,307 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-5
2026-06-26 15:34:57,708 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-6
2026-06-26 15:34:58,115 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-7
2026-06-26 15:34:58,507 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-8
2026-06-26 15:34:58,911 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-9
2026-06-26 15:34:59,310 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-10
2026-06-26 15:34:59,707 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-11
2026-06-26 15:35:00,065 INFO o.a.j.r.Summariser: summary +     39 in 00:00:05 =    8.5/s Avg:   249 Min:    40 Max:   790 Err:     0 (0.00%) Active: 11 Started: 11 Finished: 0
2026-06-26 15:35:00,123 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-12
2026-06-26 15:35:00,512 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-13
2026-06-26 15:35:00,915 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-14
2026-06-26 15:35:01,351 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-15
2026-06-26 15:35:01,714 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-16
2026-06-26 15:35:02,138 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-17
2026-06-26 15:35:02,512 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-18
2026-06-26 15:35:02,905 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-19
2026-06-26 15:35:03,305 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-20
2026-06-26 15:35:03,705 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-21
2026-06-26 15:35:04,117 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-22
2026-06-26 15:35:04,508 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-23
2026-06-26 15:35:04,904 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-24
2026-06-26 15:35:05,305 INFO o.a.j.t.JMeterThread: Thread started: Usuarios simultaneos autenticados 1-25
2026-06-26 15:35:30,001 INFO o.a.j.r.Summariser: summary +   1354 in 00:00:30 =   45.2/s Avg:   217 Min:    21 Max:  2692 Err:     0 (0.00%) Active: 25 Started: 25 Finished: 0
2026-06-26 15:35:30,005 INFO o.a.j.r.Summariser: summary =   1393 in 00:00:35 =   40.3/s Avg:   218 Min:    21 Max:  2692 Err:     0 (0.00%)
2026-06-26 15:35:55,475 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-4
2026-06-26 15:35:55,492 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-9
2026-06-26 15:35:55,501 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-12
2026-06-26 15:35:55,500 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-14
2026-06-26 15:35:55,509 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-5
2026-06-26 15:35:55,511 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-1
2026-06-26 15:35:55,526 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-24
2026-06-26 15:35:55,568 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-19
2026-06-26 15:35:55,569 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-16
2026-06-26 15:35:55,580 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-21
2026-06-26 15:35:55,581 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-8
2026-06-26 15:35:55,598 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-23
2026-06-26 15:35:55,608 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-6
2026-06-26 15:35:55,635 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-2
2026-06-26 15:35:55,642 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-17
2026-06-26 15:35:55,653 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-18
2026-06-26 15:35:55,659 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-7
2026-06-26 15:35:55,696 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-25
2026-06-26 15:35:55,703 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-20
2026-06-26 15:35:55,709 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-11
2026-06-26 15:35:55,734 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-22
2026-06-26 15:35:55,749 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Usuarios simultaneos autenticados 1-3
2026-06-26 15:35:55,749 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-3
2026-06-26 15:35:55,770 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Usuarios simultaneos autenticados 1-10
2026-06-26 15:35:55,770 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-10
2026-06-26 15:35:55,779 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Usuarios simultaneos autenticados 1-13
2026-06-26 15:35:55,780 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-15
2026-06-26 15:35:55,780 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios simultaneos autenticados 1-13
2026-06-26 15:35:55,783 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-06-26 15:35:55,787 INFO o.a.j.r.Summariser: summary +   1696 in 00:00:26 =   65.8/s Avg:    75 Min:    15 Max:   602 Err:     0 (0.00%) Active: 0 Started: 25 Finished: 25
2026-06-26 15:35:55,789 INFO o.a.j.r.Summariser: summary =   3089 in 00:01:00 =   51.2/s Avg:   140 Min:    15 Max:  2692 Err:     0 (0.00%)